import random


def choice_lan() -> str:
    """
    Запрашивает у пользователя желаемый язык программы
    :return: str: ru or en
    """
    lang: str = ""
    while lang != "ru" and lang != "en":
        lang = input("Выберите язык, русский - ru, английский - en: ")

    return lang


lang_dict: dict[str:str] = {
    "enter_your_message_en": "Enter your message",
    "enter_your_message_ru": "Введите ваше сообщение"
}


def english_to_leetspeak(message) -> str:
    """Преобразует английскую строку в сообщение и возвращает leetspeak.
    """

    # Убедитесь, что все ключи в `charMapping` написаны строчными буквами.
    char_mapping: dict[str, list[str]] = {
        "a": ["4", "/\\", "@", "/-", "\\", "^", "(L", "Д"],
        "b": ["I3", "8", "13", "|3", "ß", "!3", "(3", "/3", ")3", "|-]", "j3"],
        "c": ["[", "¢", "<", "(", "©"],
        "d": [")", "|)", "(|", "[)", "I>", "|>", "?", "T)", "I7", "cl", "|}", "|]"],
        "e": ["3", "&", "£", "€", "ё", "[-", "|=-"],
        "f": ["|=", "ƒ", "|#", "ph", "/=", "v"],
        "g": ["6", "&", "(_+", "9", "C-", "gee", "(?,", "[,", "{,", "<-", "(."],
        "h": ["#", "/-/", "\\-\\", "[-]", "]-[", ")-(", "(-)", ":-:", "|~|", "|-|", "]~[", "}{", "!-!", "1-1", "\\-/",
              "I+I", "?"],
        "i": ["1", "|", "][", "!", "eye", "3y3"],
        "j": [",_|", "_|", "._|", "._]", "_]", ",_]", "]"],
        "k": [">|", "|<", "1<", "|c", "|(", "7<"],
        "l": ["1", "2", "£", "7", "|_", "|"],
        "m": ["/\\/\\", "/V\\", "[V]", "|\\/|", "^^", "<\\/>", "{V}", "(v)", "(V)", "|\\|\\", "]\\/[", "nn", "11"],
        "n": ["^/", "|\\|", "/\\/", "[\\]", "<\\>", "{\\}", "/V", "И", "^", "ท"],
        "o": ["0", "()", "oh", "[]", "p", "<>", "Ø"],
        "p": ["|*", "|o", "|º", "?", "|^", "|>", "|", "9", "[]D", "|°", "|7"],
        "q": ["(_,)", "()_", "2", "0_", "<|", "&"],
        "r": ["I2", "9", "|`", "|~", "|?", "/2", "|^", "lz", "7", "2", "12", "®", "[z", "Я", ".-", "|2", "|-3"],
        "s": ["5", "$", "z", "§", "ehs", "es", "2"],
        "t": ["7", "+", "-|-", "']", "['", "†", "«|»", "~|~"],
        "u": ["(_)", "|_|", "v", "L|", "µ", "บ"],
        "v": ["\\/", "|/", "\\|"],
        "w": ["\\/\\/", "vv", "\\N", "'//", "\\\'", "\\^/", "dubya", "(n)", "\\V/", "\\X/", "\\|/", "\\_|_/", "\\_:_/",
              "Ш", "uu", "2u", "\\\\//\\\\//", "พ"],
        "x": ["><", "Ж", "}{", "ecks", "×", "?", "}{", ")(", "]["],
        "y": ["j", "`/", "Ч", "7", "\\|/", "¥", "\\//"],
        "z": ["2", "7_", "-/_", "%", ">_", "s", "~/_", "-\\_", "-", "|_"],
    }

    leetspeak = ""
    for char in message:  # Проверьте каждый символ
        # Вероятность того, что мы изменим символа на leetspeak,
        # составляет 70%.
        if char.lower() in char_mapping and random.random() <= 0.70:
            leetspeak = leetspeak + random.choice(char_mapping[char.lower()]) # добавляем
            # рандомный символ списка к строке
        else:
            # Не переводите этот символ.
            leetspeak = leetspeak + char
    return leetspeak


def write_result(leetspeak):
    """Записывает результат преобразования текста в файл result.txt"""
    output_text = open("results.txt", "a")
    output_text.write(str(leetspeak) + "\n")
    output_text.close()